; domain
(define (domain t3-domain)
    (:requirements :typing)
    (:types space - object
		room storage - space)
    (:predicates  (prepared ?r - room)
		(haveHoover)
        (at ?s - space)
		(clean ?r - room)
    )
    
	(:action move
        :parameters (?x - space ?y - space)
        :precondition  (at ?x)
        :effect (and (at ?y) 
			(not (at ?x))
		)
    )

	(:action getHoover
        :parameters (?s - storage)
        :precondition  (at ?s)
        :effect (haveHoover)
    )

    (:action cleanRoom
	    :parameters (?r - room)
	    :precondition (and (at ?r)
			(haveHoover)
		)
	    :effect (clean ?r)
    )
)

; problem
(define (problem t3-problem)
  (:domain t3-domain)
  (:objects 
    room1 - room
    storage1 - storage
    reception1 - space
  )
  (:init 
    (at reception1) 
  )
  
  (:goal 
    (clean room1)
   )
)

; plan
1. (move reception1 room1)
   deleted: (at reception1)
   added: (at room1)
   goals met: 0 of 1
2. (move room1 storage1)
   deleted: (at room1)
   added: (at storage1)
   goals met: 0 of 1
3. (gethoover storage1)
   added: (havehoover)
   goals met: 0 of 1
4. (move storage1 room1)
   deleted: (at storage1)
   added: (at room1)
   goals met: 0 of 1
5. (cleanroom room1)
   added: (clean room1)
   goals met: 1 of 1
